# 01- How to find the version?

In [ ]:
import pandas as pd
pd.__version__

In [ ]:
# another way
pd.show_versions()

# 02- Make a Datafram

In [ ]:
df = pd.DataFrame({"A col": [1, 2, 3], "B col": [4, 5, 6]})
df.head()

In [ ]:
# numpy array use to create dataFrame
import numpy as np

arr = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
pd.DataFrame(arr)

In [ ]:
# numpy array dataFrame
pd.DataFrame(np.random.rand(2,6), columns=list('ABCDEF'))

# 03- How to rename columns?

In [ ]:
df = pd.DataFrame({"A col": [1, 2, 3], "B col": [4, 5, 6]})
df.rename(columns={'A col': 'A', 'B col': 'B'}, inplace=True)
print(df)

In [ ]:
# rename columns
df.columns=['col_aa', 'col_bb']
df

In [ ]:
# to replace any character, string
df.columns = df.columns.str.replace('_','-')
df

In [ ]:
df = df.add_prefix('test_')
df

In [ ]:
df = df.add_suffix('_test')
df

In [ ]:
df.columns = ['col-a', 'col-b']
df

# 04- Using Template Data

In [ ]:
import pandas as pd
import seaborn as sns
import numpy as np

df = sns.load_dataset('titanic')
df.info()

In [ ]:
df.to_csv("../files/titanic.csv")
df.to_excel("../files/titanic.xlsx")

# 05- Using your own data

In [ ]:
import pandas as pd
df = pd.read_csv("../files/titanic.csv")
df

# 06- Reverse Row Order

In [ ]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset("titanic")
df = df.loc[::-1] #reverse row order
df = df.reset_index(drop=True) #reset index
df

# 07- Reverse Column Order

In [ ]:
df.loc[:, ::-1].head()

# 08- select a column by dtype

In [ ]:
# get all data frames column dtypes
df.dtypes

In [ ]:
# only select those have numeric type
df.select_dtypes(include=['number']).head()

In [ ]:
# only select those have object
df.select_dtypes(include=['object']).head()

In [ ]:
# exclude column type
df.select_dtypes(exclude=['number', 'object']).head()

# 09- Convert strings to number

In [ ]:
df = pd.DataFrame(
    {"col_a": [1, 2, 3, 4, 5, 6, 7, 8, 9], "col_b": [10, 11, 12, 13, 14, 15, 16, 17, 18]}
)
df

In [ ]:
# method 1
df.astype({'col_a': 'int64', 'col_b': 'int64'}).dtypes

In [ ]:
# method 2
pd.to_numeric(df['col_a'], errors='coerce')
df.dtypes

# 10- Reduce dataframe size

In [ ]:
df = sns.load_dataset('titanic')
df.shape

In [ ]:
df.info(memory_usage='deep')

In [ ]:
df.sample(frac=0.1).shape
df.info()

# 11- Copy data from clip board

In [ ]:
# dataset download
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.to_excel("../files/titanic.xlsx")

In [ ]:
# read clipboard in python
df = pd.read_clipboard()
df

# 12-  split database into two subsets

In [ ]:
# dataset download
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.head()

In [ ]:
df.shape

In [ ]:
kashti_1 = df.sample(frac=0.5, random_state=1)
kashti_1.shape

In [ ]:
kashti_2 = df.drop(kashti_1.index)
kashti_2.shape

# 13- Join two datasets

In [ ]:
df1= kashti_1._append(kashti_2)
df1.shape

# 14- Filtering a dataset

In [57]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [67]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [68]:
# filter by column values
df[(df.sex == 'female')]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False